Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །རྒྱལ་བ་ཀུན་གྱིས་སྔོན་ཆད་གང་གསུངས་པ། །ཤིན་ཏུ་རྒྱས་མདོ་གླེང་གཞི་ཆེན་པོ་འདི།
en: This vast sūtra, this great discourse, Was taught by all the victorious ones of times past.

source: །ཐུབ་པ་འདོད་ཆགས་བསལ་བས་དེ་རིང་ཡང་།
en: Today as well, O Sage, since you have dispelled attachment,

source: །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀུན་བཟུང་བཞེད་པས།
en: “ ‘Consider the assembly of bodhisattvas,

source: །ཕས་ཀྱི་རྒོལ་དང་བདུད་རྣམས་འདུལ་མཛད་ལ།
en: Defeat opponents and tame all demons,

source: །ཐེག་པ་ཆེན་པོ་མཆོག་འདི་རབ་གསུང་ཞིང་།
en: By teaching us this supreme Great Vehicle.

source: །ཐུབ་པ་དེ་སླད་ལེགས་པར་བཤད་དུ་གསོལ།
en: Thus, Able One, please grant us your lucid explanations.’

source: །ལྷ་ཡི་ཚོགས་ཀྱིས་གསོལ་བ་དེ་སྣང་ཕྱིར།
en: “The assembly of gods thus offered their request,

source: །མི་གསུང་གྱུར་པས་གནང་བ་མཛད་པས་ན།
en: And with my silence, I indicated my consent.

source: །ཐམས་ཅད་ཚིམ་ཞིང་རབ་དགའ་མགུ་གྱུར་ནས།
en: This brought them joy and satisfaction,

source: །དགའ་བ་ཐོབ་པས་མེ་ཏོག་སིལ་མ་གཏོར།
en: And with delight they scattered flower petals.

source: །དེ་ཕྱིར་དགེ་སློང་ཤིན་ཏུ་རྒྱས་པའི་མདོ། །འཇིག་རྟེན་ཀུན་ལ་ཕན་པའི་དོན་གྱི་ཕྱིར། །དེ་བཞིན་གཤེགས་པ་ཀུན་གྱིས་སྔོན་བཤད་པ།
en: “Thus listen here, monks, to this vast sūtra, Taught in times past by all the thus-gone ones For the welfare of all the worlds.

source: །གླེང་གཞི་ཆེན་པོ་ཁྱེད་ཀུན་འདིར་ཉོན་ཅིག །གླེང་གཞིའི་ལེའུ་སྟེ་དང་པོའོ།། །།
en: Listen, one and all, to this great discourse.” This concludes the first chapter, on the setting.

source: དགེ་སློང་དག་དེ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་དེ་གང་ཞེ་ན།
en: Now, monks, what is this extensive discourse on the Dharma known as The Play in Full?

source: དགེ་སློང་དག་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་མཆོག་ན་གནས་པ། མཆོད་པར་བྱ་བས་མཆོད་པ། དབང་བསྐུར་བ་ཐོབ་པ། ལྷ་བརྒྱ་སྟོང་གིས་བསྟོད་ཅིང་བཀུར་ཏེ་བརྗོད་ཅིང་བསྔགས་པ། བསམ་པ་ཐོབ་པ།
en: Monks, the Bodhisattva dwelt in the supreme realm of the Heaven of Joy, where he was honored by offerings, received consecration, and was praised and revered by one hundred thousand gods.

source: སྨོན་ལམ་གྱིས་ཡང་དག་པར་འཕགས་པ།
en: He had achieved his goal and was elevated by his former aspirations.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་ཐོབ་པའི་བློ་དང་ལྡན་པ།
en: His intelligence was such that he had attained the entire range of the Buddhadharma.

source: ཡེ་ཤེས་ཀྱི་མིག་ཤིན་ཏུ་རྒྱས་ཤིང་ཡོངས་སུ་དག་པ་དང་ལྡན་པ།
en: Indeed his eye of wisdom was at once both vast and utterly pure.

source: དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། ཁྲེལ་ཡོད་པ་དང་། དགའ་བ་འབར་བའི་བློ་རླབས་པོ་ཆེ་དང་ལྡན་པ།
en: Radiating with mindfulness, intelligence, realization, modesty, and joyfulness, his mind was extremely powerful.

source: སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་ལ་མཁས་པ་ཆེན་པོའི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ།
en: He had mastered the perfections of generosity, discipline, patience, diligence, mental stability, knowledge, and skillful means, and was adept in the fourfold path of Brahmā:

source: ཚངས་པའི་ལམ་བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་། བཏང་སྙོམས་ཆེན་པོ་ལ་མཁས་པ།
en: great love, great compassion, great joy, and great equanimity.

source: མངོན་པར་ཤེས་པ་དང་། རིག་པ་ཆེན་པོས་སྒྲིབ་པ་མེད་ཅིང་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་མངོན་དུ་གྱུར་པ།
en: With great awareness, he was free of obscurations and had manifested the vision of wisdom free from attachment.

source: དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པའི་མཐར་ཕྱིན་པ།
en: Likewise he had perfected each and every quality of awakening: the applications of mindfulness, the thorough relinquishments, the bases of miraculous power, the faculties, the powers, the branches of awakening, the path, and the factors of awakening.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་དཔག་ཏུ་མེད་པའི་མཚན་དང་དཔེ་བྱད་བཟང་པོས་ལུས་ལེགས་པར་བརྒྱན་པ། ཡུན་རིང་པོར་རྗེས་སུ་འབྲང་བ་དང་ལྡན་པ།
en: Sublime signs and marks, indicating his boundless accumulation of merit and wisdom, beautifully adorned the body of the Bodhisattva, who had engaged in proper conduct for a long time.

source: ཇི་སྐད་དུ་སྨྲས་པ་དེ་ལྟར་བྱེད་པས་ལོག་པ་མེད་པའི་ཚིག་གི་ལམ་ཡང་དག་པར་སྨྲ་བ།
en: Acting in perfect accordance with his words, his unerring statements were always genuine.

source: དྲང་ཞིང་མ་ཡོ་ལ། གྱ་གྱུ་མེད་པའི་ཡིད་ཐོགས་པ་མེད་པ་དང་ལྡན་པ།
en: At once honest, straightforward, and free of guile, his mind was invincible.

source: ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་། འཇིགས་པ་དང་། ཞུམ་པ་ཐམས་ཅད་མེད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ།
en: Free of pride, conceit, arrogance, fear, and timidity, he was impartial toward all beings.

source: སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་པ་ལ་བསྙེན་བཀུར་བྱས་པ།
en: The Bodhisattva had paid homage to countless awakened beings, to billions upon billions of buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོས་ངོར་བལྟ་ཞིང་བལྟ་བའི་བཞིན་དང་ལྡན་པ།
en: His loving gaze was revered by billions upon billions of bodhisattvas.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། སྲིན་པོ་རྣམས་ཀྱིས་མངོན་པར་དགའ་བར་བྱ་བའི་གྲགས་པ་དང་ལྡན་པ།
en: Likewise Śakra, Brahmā, Maheśvara, the guardians of the world, gods, nāgas, gandharvas, demigods, garuḍas, kinnaras, and yakṣas, in their multitudes, rejoiced in his glory.

source: ཚིག་ཐམས་ཅད་རབ་ཏུ་ཕྱེ་སྟེ་བསྟན་པ་ལ་ཐོགས་པ་མེད་པའི་སོ་སོ་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པའི་ཤེས་པ་ལ་མཁས་པ།
en: Having perfectly discerned their every word, the Bodhisattva’s learned understanding of the teachings was at once unimpeded, discerning, and perfect.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་པ་གཟུང་བ་ལ་དྲན་པའི་སྣོད་འཁྲུལ་པ་མེད་པ་དང་། གཟུངས་མཐའ་ཡས་མུ་མེད་པ་རབ་ཏུ་ཐོབ་པ།
en: He was an unerring vessel of mindfulness, able to recall the teachings of all the buddhas. The number of dhāraṇīs he had received was infinite.

source: དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པའི་ཆོས་རིན་པོ་ཆེ་དང་། བསོད་ནམས་ཀྱིས་ཡང་དག་པར་བསྒྲུབས་པའི་ཆོས་ཀྱི་གྲུ་ཆེན་པོའི་དེད་དཔོན་ཆེན་པོ།
en: The Bodhisattva was the great captain of the vessel of the Dharma, which he had perfectly accomplished through the applications of mindfulness, the thorough relinquishments, the bases of miraculous power, the faculties, the powers, the branches of awakening, the path, the perfection of knowledge, the precious quality of skillful means, and merit.

source: ཆུ་བོ་བཞིའི་ཕ་རོལ་ཏུ་འགྲོ་བའི་བསམ་པ་ཅན། བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཤིན་ཏུ་ཚར་བཅད་པ།
en: With the intention to travel beyond the four rivers, he conquered Māra, subdued hostile forces, and defeated all of his opponents.

source: གཡུལ་ངོའི་ཐོག་མ་ལ་རབ་ཏུ་འདུག་པ། ཉོན་མོངས་པའི་དགྲའི་ཚོགས་འཇོམས་པ། ཡེ་ཤེས་མཆོག་གི་རྡོ་རྗེའི་མཚོན་སྲ་བ་དང་ལྡན་པ།
en: Indeed he set himself at the frontlines and destroyed the enemy hordes of the afflictions with the firm vajra weapon of supreme wisdom.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་རྩ་བ་ལས་སྙིང་རྗེ་ཆེན་པོའི་ཆུ་བ་ལྷག་པའི་བསམ་པས་སྐྱེས་པ་ཟབ་ཅིང་བརྟན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཆོས་ཀྱི་ཆུས་མངོན་པར་བརླན་པ།
en: This great being was like a lotus. Having a stem of great compassion deeply rooted in the mind of awakening, this lotus was born of superior intention.

source: ཐབས་མཁས་པའི་སྙིང་པོ་དང་ལྡན་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བསམ་གཏན་གྱི་ཟེ་བ་ཅན།
en: It was sprinkled with the water of profound diligence and had skillful means as its center, branches of awakening for its anthers, and mental stability for its stamen.

source: ཏིང་ངེ་འཛིན་གྱི་ཟེ་འབྲུ་དང་ལྡན་པ། ཡོན་ཏན་གྱི་ཚོགས་རྒྱ་ཆེན་པོའི་མཚོ་ལས་སྐྱེས་པ།
en: This lotus arose from an immaculate ocean of a vast accumulation of virtues.

source: ང་རྒྱལ་དང་དྲེགས་པའི་གདུང་བ་མེད་པའི་ཟླ་བས་དྲི་མ་མེད་པའི་འདབ་མ་རྒྱས་པ།
en: Its blossoming petals, illuminated by moonlight free from the torment of pride and arrogance, were pristine.

source: ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། བག་ཡོད་པའི་བསུང་གི་ངད་ཕྱོགས་བཅུར་ཐོགས་པ་མེད་པར་ལྡང་བ། འཇིག་རྟེན་ན་ཤེས་པའི་ཐུ་བོར་གྱུར་པ། འཇིག་རྟེན་གྱི་ཆོས་བརྒྱད་ཀྱིས་མ་གོས་པ། སྐྱེས་བུ་ཆེན་པོའི་པད་མ།
en: Emitting the scent of discipline, study, and conscientious speech unhindered throughout the ten directions, this lotus was foremost throughout the world in terms of knowledge, yet untainted by the eight worldly concerns.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཀྱི་དྲི་ཞིམ་པོ་འབྱུང་བ། ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱི་ཉི་མའི་འོད་ཟེར་གྱིས་མིག་ཤིན་ཏུ་རྣམ་པར་དག་པའི་པད་མ་འདབ་མ་བརྒྱ་པ་རྒྱས་པ།
en: It radiated the sweet fragrance of the accumulation of merit and wisdom, while the sunlight of knowledge and wisdom warmed it, causing the hundred petals of its pure vision to blossom. The Bodhisattva was a lion among men.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་མཆོག་ཏུ་མགྱོགས་པའི་ཤུགས་དང་ལྡན་པ། འཕགས་པའི་བདེན་པ་བཞིའི་སྡེར་མོ་དང་མཆེ་བ་ཤིན་ཏུ་རྣོ་བ།
en: Swift and strong were his four bases of miraculous power, just as the claws and fangs of the four noble truths were extremely sharp.

source: ཚངས་པའི་གནས་པ་བཞིའི་སོ་དྲང་བསྙེར་བ། བསྡུ་བའི་དངོས་པོ་བཞིས་ཤིན་ཏུ་བསྡུས་པའི་མགོ་དང་ལྡན་པ།
en: He bared the fangs of the four communions with Brahmā and gathered others through the four ways of attraction with his head.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་ཁོང་དུ་ཆུད་པས་རིམ་གྱིས་འཕགས་པའི་ལུས་དང་ལྡན་པ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་དག་པར་ཡོངས་སུ་རྫོགས་པས་རལ་པ་ཅན་དུ་བྱས་ཤིང་། རིག་པ་དང་། ཡེ་ཤེས་ཀྱི་ཟེ་བ་ཅན། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་གྱི་ཁ་གདངས་པ། ཞི་གནས་དང་ལྷག་མཐོང་ཤིན་ཏུ་རྣམ་པར་དག་པའི་མིག་དང་ལྡན་པ།
en: With a well-proportioned body, due to having understood the twelve links of dependent origination, and a flowing mane of the complete perfection of the thirty-seven factors of awakening, along with awareness and wisdom, his mouth opened with the three gateways to liberation, while his eyes indicated the utter purity of tranquility and insight.

source: བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་རི་སུལ་གྱི་ཕུག་ན་གནས་པ།
en: He dwelt in the mountain caves of mental stability, complete liberation, absorption, and deep meditation.

source: སྤྱོད་ལམ་བཞི་དང་། འདུལ་བའི་ནགས་ཚལ་དང་། ནགས་འདབ་ནས་སྐྱེས་པའི་ལུས་དང་ལྡན་པ། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། ཉེ་བའི་སྟོབས་དང་ལྡན་པ།
en: Born of the jungles of the four activities and discipline, he was endowed with the ten powers, the fourfold fearlessness, and perfect might.

source: སྐྱེ་བ་དང་འཇིག་པའི་འཇིགས་པ་དང་སྤུ་གཡོ་བ་མེད་པ། རྩལ་ལ་ཞུམ་པ་མེད་པ།
en: The hairs on his body did not bristle with the fear of creation and destruction, nor did his valor ever diminish.

source: མུ་སྟེགས་ཅན་གྱི་བོང་བུ་དང་རི་དགས་མང་པོའི་ཚོགས་རབ་ཏུ་འཇོམས་པ། བདག་མེད་པར་སྒྲ་བརྗོད་པའི་སེང་གེའི་ང་རོ་ཆེན་པོ་སྒྲོག་པ། སྐྱེས་བུ་སེང་གེ།
en: He subdued the masses of extremists, who are like rabbits and deer, letting out the great lion’s roar of no self.

source: རྣམ་པར་གྲོལ་བ་དང་། བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་ལས་ཤེས་རབ་ཀྱི་འོད་དང་། འོད་ཟེར་གྱིས་མུ་སྟེགས་བྱེད་སྲིན་བུ་མེ་ཁྱེར་གྱི་ཚོགས་འོད་མེད་པར་བྱེད་པ། མ་རིག་པའི་མུན་པ་མུན་ནག་གི་ལིང་ཏོག་དང་རབ་རིབ་མེད་པར་བྱེད་པ།
en: As the sun of great beings, light rays of knowledge radiated from the orb of his liberation and concentration, dispelling the light of the swarms of extremists, who are like fireflies, and eliminating the darkness and obscuring film of ignorance.

source: སྟོབས་དང་བརྩོན་འགྲུས་འབར་བ། ལྷ་དང་མིའི་ནང་དུ་བསོད་ནམས་ཀྱི་གཟི་བརྗིད་ཀྱི་གཟི་དང་ལྡན་པ་སྐྱེས་བུ་ཆེན་པོའི་ཉི་མ།
en: Indeed, with brilliant strength and diligence, the radiant majesty of his merit shone brightly among gods and humans.

source: ནག་པོའི་ཕྱོགས་མེད་པ།
en: As the light of the moon, there was no darkness within him;

source: དཀར་པོའི་ཕྱོགས་ཡོངས་སུ་རྫོགས་པ།
en: he perfectly embodied all that is wholesome.

source: བལྟ་ན་སྡུག་ཅིང་ཡིད་དུ་འོང་བས་མིག་གི་དབང་པོ་ལ་ཐོགས་པ་མེད་པ།
en: The sight of him was beautiful to behold and pleasing to the mind, and his eye faculty was unobstructed.

source: ལྷ་བརྒྱ་སྟོང་གི་སྐར་མའི་ཚོགས་ཀྱིས་ཤིན་ཏུ་བརྒྱན་པ། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཅན། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་བདེ་བས་ཟླ་བའི་འོད་ཟེར་དུ་གྱུར་པ། མི་དང་ལྷ་མཁས་པའི་མེ་ཏོག་ཀུ་མུ་ད་ཁ་འབྱེད་པ་སྐྱེས་བུ་ཆེན་པོ་ཟླ་བ།
en: Adorned by the constellations of one hundred thousand gods, the moonlight of the soothing branches of awakening radiated from this sphere of concentration, liberation, and wisdom, causing the lilies among humans and gods to bloom.

source: འཁོར་གྱི་གླིང་བཞིར་སོང་བ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གྱི་རིན་པོ་ཆེ་དང་ལྡན་པ།
en: The Great Bodhisattva was followed by a fourfold retinue, like the moon by the four continents, and he was endowed with the jewels of the seven branches of awakening.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པར་སྦྱོར་བ། བློ་དཔྱད་ཐོགས་པ་མེད་པ།
en: He engaged all beings equally and possessed an unimpeded analytical capacity.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་དཀའ་ཐུབ་དང་བརྟུལ་ཞུགས་ཤིན་ཏུ་ཕུན་སུམ་ཚོགས་ཤིང་རབ་ཏུ་རྫོགས་པས་ཁྱད་པར་དུ་བོགས་དབྱུང་བར་བྱ་བའི་བསམ་པ་ཅན།
en: His intention was enhanced by the sublime and perfectly complete austerities and spiritual practices that he observed on the path of the ten virtuous activities.

source: ཆོས་ཀྱི་རྒྱལ་པོའི་ཆོས་ཀྱི་འཁོར་ལོ་རིན་པོ་ཆེ་མཆོག་དམ་པ་ཐོགས་པ་མེད་པར་བསྐོར་བ། འཁོར་ལོས་སྒྱུར་བའི་རིགས་ཀྱི་རྒྱུད་དུ་བྱུང་བ། ཆོས་ཀྱི་འཁོར་ལོས་སྒྱུར་བ་ཆེན་པོ།
en: As the king of Dharma, he turned the precious wheel of the supreme Dharma without hindrance, having been born into a line of universal monarchs.

source: །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་བ། ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་གང་བ།
en: Filled with all the precious teachings, including that of dependent origination, so profound and difficult to fathom, he never tired of study.

source: ཐོས་པས་མི་ངོམས་པས་ཡངས་ཤིང་རྒྱ་ཆེ་ལ་མཐའ་ཡས་པའི་ཡེ་ཤེས་དང་ཚུལ་ཁྲིམས་ཀྱི་ཚོད་ལས་མི་འདའ་བ།
en: Thus his boundless wisdom had become vast and all-encompassing. His discipline was beyond measure as well.

source: བློ་རྒྱ་མཚོ་དང་ས་ལྟར་རྒྱ་ཆེ་བའི་མཆོག་ཏུ་གྱུར་པ།
en: Indeed his mind was as vast as the oceans and the earth.

source: ས་དང་ཆུ་དང་མེ་དང་རླུང་དང་མཉམ་པའི་སེམས་སུ་གྱུར་པ། རི་རབ་ལྟར་བརྟན་ཞིང་མི་གཡོ་ལ་བསྐྱོད་པར་མི་ནུས་པའི་ཡིད་དང་ལྡན་པ།
en: Equal to earth, water, fire, and air, his mind was as firm and unmoving as Mount Meru.

source: རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་མེད་པ། ནམ་མཁའི་དཀྱིལ་ལྟར་དྲི་མ་མེད་ཅིང་ཡངས་ལ་འདྲ་བ་མེད་པར་རྒྱ་ཆེ་བའི་བློ་དང་ལྡན་པ།
en: He was free from attachment and aversion, with a mind as pristine and open as the center of space; it was vast and unlike any other.

source: ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པ།
en: His superior intent was utterly pure.

source: སྦྱིན་པ་ལེགས་པར་བྱིན་པ། སྔོན་སྦྱོར་བ་ལེགས་པར་བྱས་པ། ལྷག་པའི་བྱ་བ་ལེགས་པར་བྱས་པ། བདེན་པའི་རྒྱན་གྱིས་ལེགས་པར་བརྒྱན་པ།
en: His acts of generosity were done well, as were his previous endeavors and his superior deeds.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བ། གོས་པར་བྱ་བ་བསྒོས་པ།
en: He sought out all basic virtues and had formed positive habitual tendencies.

source: དགེ་བའི་རྩ་བ་ངེས་པར་བྱས་པ། བསྐལ་པ་གྲངས་མེད་པ་བདུན་དུ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབས་པ། སྦྱིན་པ་རྣམ་པ་བདུན་བྱིན་པ།
en: Ascertaining the basic virtues, he practiced all such virtues for seven incalculable eons.

source: བསོད་ནམས་བྱ་བའི་དངོས་པོ་ལྔ་ཤིན་ཏུ་བསྟེན་པ། ལེགས་པར་སྤྱད་པ་ལུས་ཀྱི་རྣམ་གསུམ། ངག་གི་རྣམ་བཞི། ཡིད་ཀྱི་རྣམ་གསུམ་སྤྱད་པར་གྱུར་པ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་བསྟེན་པ་དང་ལྡན་པ། ཡང་དག་པའི་སྦྱོར་བ་ཡན་ལག་བཞི་བཅུ་དང་ལྡན་པ་བསྟེན་པར་གྱུར་པ།
en: He practiced the seven forms of generosity and engaged in the five types of action that create merit, just as he tread the path of the ten virtues—the three physical, the four verbal, and the three mental wholesome actions—and practiced the forty kinds of correct application.

source: ཡང་དག་པའི་སྨོན་ལམ་ཡན་ལག་བཞི་བཅུ་དང་ལྡན་པའི་སྨོན་ལམ་བཏབ་པ། ལྷག་པའི་བསམ་པ་ཡན་ལག་བཞི་བཅུ་དང་ལྡན་པ་ལ་ཞུགས་པ། ཡང་དག་པའི་རྣམ་པར་ཐར་པ་ཡན་ལག་བཞི་བཅུ་དང་ལྡན་པ། ཡོངས་སུ་རྫོགས་པར་བྱས་པ། ཡང་དག་པའི་མོས་པ་ཡན་ལག་བཞི་བཅུ་དང་ལྡན་པ་དྲང་པོར་བྱས་པ།
en: Likewise did he make the forty kinds of correct aspiration, immerse himself in the forty kinds of right intention, perfect the forty kinds of liberation, and erect the forty kinds of right interest.

source: སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བཞི་བཅུའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བ། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ལྔ་བཅུ་རྩ་ལྔ་ལ་སྦྱིན་པ་ཕུལ་བར་གྱུར་པ།
en: He took ordination with four million buddhas and presented five and a half million buddhas with offerings.

source: རང་སངས་རྒྱས་བྱེ་བ་བརྒྱ་ཕྲག་ཕྱེད་དང་བཞི་ལ་ལྷག་པར་བྱ་བ་བྱས་པ།
en: Similarly the Bodhisattva served 1,540 million solitary buddhas.

source: སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་མཐོ་རིས་དང་ཐར་པའི་ལམ་དུ་བཙུད་པར་གྱུར་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ།
en: Establishing innumerable sentient beings on the paths to the higher realms and liberation, he desired to become perfectly and completely awakened, to attain supreme, genuine, and complete awakening.

source: ཚེ་གཅིག་གིས་ཐོགས་པ། འདི་ནས་ཤི་འཕོས་ནས་དགའ་ལྡན་གྱི་གནས་དམ་པ་ན་གནས་པ་ལྷའི་བུ་དམ་པ་ཏོག་དཀར་པོ་ཞེས་བྱ་བ།
en: With only one lifetime remaining, he passed away and was reborn in the supreme realm of the Heaven of Joy as a supreme divine child named Śvetaketu.

source: ལྷའི་ཚོགས་རྣམས་ཀྱིས་འདི་ནི་འདི་ནས་ཤི་འཕོས་ནས་མིའི་འཇིག་རྟེན་དུ་སྐྱེས་ཏེ། རིང་པོ་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་དེར་ཤིན་ཏུ་མཆོད་པ།
en: The assembly of gods showed him great reverence, honoring him as one who would leave their midst and take birth in the human world, where before long he would become the Buddha, attaining perfect, complete, and unexcelled awakening.

source: གཞལ་མེད་ཁང་གནས་སུམ་ཁྲི་ཉིས་སྟོང་ལ་རབ་ཏུ་གནས་པ། སྟེགས་བུ་དང་། བ་གམ་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་། བསིལ་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁྱམས་ཀྱིས་ལེགས་པར་བརྒྱན་པ།
en: He dwelt in a celestial palace with 32,000 floors, adorned with verandas, domes, architraves, skylights, cool pavillions, multiple stories, and courtyards.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྒྲེང་བ།
en: This palace was filled with parasols, flags, and streaming banners;

source: རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཁའི་དྲ་བའི་བླ་རེ་བྲེས་པ། མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དག་ཆལ་པར་བཀྲམ་པ།
en: it was covered by canopies of tiny jeweled bells and strewn with māndārava and mahāmāndārava flowers.

source: ལྷའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གླུ་དབྱངས་ལེན་པ།
en: The songs of millions upon millions of celestial maidens could be heard throughout.

source: མེ་ཏོག་ཨ་ཏི་མུཀ་ཏ་ཀ་དང་། ཙམ་པ་ཀ་དང་། སྐྱ་སྣར་དང་། ས་བརྟོལ་དང་། བཏང་བཟུང་དང་། བཏང་བཟུང་ཆེན་པོ་དང་། མྱ་ངན་འཚང་དང་། ནྱ་གྲོ་དྷ་དང་། ཏིན་དུ་ཀ་དང་། ཨཱ་ས་ན་དང་། དོང་ཀའི་མེ་ཏོག་དང་། ཤིང་ཀེ་ས་ར་དང་། ཏ་མ་ལ་དང་། སཱ་ལ་དང་། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་ཆེན་པོས་བརྒྱན་པ། གསེར་གྱི་དྲ་བས་གཡོགས་པ། གཞི་མཉམ་ཞིང་བཀོད་པས་མཛེས་པར་བྱས་པ།
en: Its enchanting, even grounds were covered with golden canopies and filled with various trees, such as mountain ebonies, campakas, trumpet vines, orchids, muchalindas, mahāmuchalindas, aśokas, banyans, persimmon trees, narras, karṇikāras, kesaras, sāls, and coral trees.

source: མེ་ཏོག་སྣང་འོད་དང་། མཱ་ལི་ཀ་དང་། སྣ་མའི་མེ་ཏོག་དང་། བཱར་ཤི་ཀ་དང་། ཏ་ར་ནི་དང་། བ་ལི་དང་། ཀོ་ཏ་ར་ནི་དང་། མཆོག་ཏུ་དྲི་ཞིམ་དང་། དྷ་ནུས་ཀ་རི་དང་། ལྷའི་སྣ་མའི་མེ་ཏོག་དང་། ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། དྲི་རབ་ཏུ་ཞིམ་པའི་བླ་རེ་ཆེན་པོ་ཕྱོགས་ཕྱོགས་སུ་བྲེས་པ།
en: In every direction there were flowered canopies, overflowing with jyotiṣ, mālikas, barasikas, taraṇīs, sumanas, bali, kotaranis, and other sweet-smelling flowers. Likewise there were danukari flowers, celestial flowers, blue lotuses, pink lotuses, water lilies, and white lotuses.

source: བྱ་འདབ་སྤེན་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ངང་པ་དང་། རྨ་བྱ་དང་། ངུར་པ་དང་། ཀུ་ན་ལ་དང་། ཀ་ལ་པིང་ཀ་དང་། ཤང་ཤང་ཏེའུ་ལ་སོགས་པ་བྱ་སྣ་ཚོགས་སྒྲ་སྙན་པ་འབྱིན་པ།
en: Various birds flew through the air, singing out their beautiful melodies. Among them were parrots, śārikas, cuckoos, geese, peacocks, ducks, pheasants, snipe, partridge, and many others.

source: ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་མིག་མངོན་དུ་ཕྱོགས་ཏེ་བལྟ་ཞིང་ལྟད་མོར་བྱ་བ།
en: Millions upon millions of gods turned their eyes toward the palace and gazed at it in awe.

source: ཆོས་རྒྱ་ཆེ་བ་ཆེན་པོ་ཡང་དག་པར་བརྗོད་པས་འདོད་པ་ལ་དགའ་བའི་ཤུགས་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་གཅོད་པ། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པ་དང་། ཁྲོ་བ་དང་། ཐ་བ་དང་། ཁོང་ཁྲོ་བ་མེད་པར་གྱུར་པ། དགའ་བ་དང་། མགུ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། དྲན་པ་རྒྱ་ཆེ་ཞིང་གསལ་བ་སྐྱེ་བའི་གཞལ་མེད་ཁང་ཆེན་པོ་དེ་ན་བདེ་བར་གནས་ཤིང་ཆོས་ཀྱི་ཡང་དག་པའི་གཏམ་བྱུང་བ་དང་། སིལ་སྙན་དང་། གླུ་དབྱངས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོའི་སྒྲ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་ལས་དགེ་བའི་ཚོགས་ཀྱིས་ཡང་དག་པར་བསྐུལ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་བྱུང་ངོ་།
en: The great and vast Dharma was proclaimed throughout, and thereby the force of their enthusiastic desire subdued all the afflictions, eliminating pride, conceit, arrogance, aggression, rage, and anger, and bringing about happiness, well-being, joy, and mindfulness on a vast scale. The Bodhisattva dwelt comfortably in this great celestial palace, where a discourse on the genuine Dharma emerged amid a symphony of 84,000 musical instruments. From their sound, the following verses of inspiration arose, telling of the many virtuous deeds that the Bodhisattva carried out in times past:

source: །བསོད་ནམས་རྒྱ་ཆེན་ཚོགས་མངའ་དྲན་རྟོགས་དང་། །བློ་གྲོས་མཐའ་ཡས་ཤེས་རབ་འོད་མཛད་པ།
en: “Recall the power of your vast store of merit And the illuminating knowledge of your boundless intelligence,

source: །མཚུངས་མེད་སྟོབས་མངའ་སྐུ་རྩལ་རྒྱ་ཆེ་བ།
en: Peerless strength, and great power.

source: །མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་དགོངས་པར་མཛོད།
en: Recall the prophecy of Dīpaṃkara.

source: །རྒྱ་ཆེན་དྲི་མ་མེད་པའི་ཐུགས་མངའ་བ།
en: “With a mind free from the vast range of impurities,

source: །དྲི་མ་གསུམ་སྤངས་རྒྱགས་དང་སྐྱོན་ཞི་བ།
en: You have pacified conceit and flaws, relinquishing the three stains,

source: །དགེ་བ་དྲི་མེད་རྣམ་པར་དག་པའི་ཐུགས།
en: While your virtuous heart is at once pristine and free from fault.

source: །སྔོན་ཆད་ཇི་ལྟར་སྦྱིན་སྤྱད་དགོངས་པར་མཛོད།
en: Bring to mind your generous deeds of times past.

source: །ཞི་གནས་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་བཟོད་པ་དང་། །དུལ་དང་བརྩོན་འགྲུས་བསམ་གཏན་ཤེས་རབ་སྟོབས།
en: “You have cultivated tranquility and discipline, Practiced austerities and patience, subdued and diligent.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས་སྤྱད་པ། །སྤྱོད་རིགས་ཆེར་བྱུང་དགོངས་མཛོད་དགོངས་པར་མཛོད།
en: With concentration and the strength of knowledge, Bring to mind all the deeds you engaged in over billions of eons.

source: །སེམས་ཅན་རྣམས་ལ་ཐུགས་བརྩེ་མཛད་གྱུར་ཅིང་།
en: “You developed compassion for all sentient beings

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་ཁྱོད་ཀྱིས་མཆོད།
en: And made offerings to billions of buddhas.

source: །དགོངས་མཛོད་དགོངས་པར་མཛོད་ཅིག་གྲགས་མཐའ་ཡས།
en: Remember, do not forget, you who are of infinite renown!

source: །དེ་དུས་ལགས་ཀྱིས་བཏང་སྙོམས་མ་མཛད་ཅིག །རྒ་ཤི་ཉོན་མོངས་འཇིག་མཛད་རྡུལ་བྲལ་བ།
en: Now the time has come—do not let it slip away! “Immaculate One, destroyer of the afflictions, birth, and death:

source: །ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དྲི་ཟ་དང་། །ལྷ་མིན་དབང་པོ་དག་ཀྱང་སྡོད་ལགས་ཀྱིས།
en: Gods, nāgas, yakṣas, gandharvas, And the powerful demigods await you.

source: །འཆི་འཕོའི་ཚུལ་མཁྱེན་འཕོ་བ་བསྟན་པར་མཛོད།
en: You who know the way of death and passing away, take rebirth.

source: །བསྐལ་པ་སྟོང་དུ་དཀའ་བ་སྤྱད་གྱུར་ཀྱང་།
en: “Even enjoying pleasurable things for thousands of eons

source: །རྒྱ་མཚོ་ཆུ་ཡིས་ཇི་བཞིན་མི་ངོམས་ཀྱིས།
en: Will not satisfy them, just as saltwater will not slake one’s thirst.

source: །ངོམས་པ་ཁྱོད་ཀྱི་ཐུགས་དམ་དགེ་བ་སྟེ།
en: Now that you yourself are sated, be kind;

source: །ཡུན་རིང་སྐོམ་ཉེན་སྐྱེ་བོ་ཚིམ་པར་མཛོད།
en: Please satisfy those who have thirsted for so long.

source: །སྨད་པ་མེད་པའི་གྲགས་པ་མངའ་བ་ཁྱོད།
en: “Are you not one of untarnished reputation

source: །ཆོས་ལ་དགྱེས་པར་ཁྱོད་དགྱེས་འདོད་མི་དགྱེས།
en: Who takes delight in the Dharma, not desire?
